HaiHeHuoc/Smart_Room_Cloud_Gateway/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.0.1 Project Minimal Configuration
#
# default:
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_LWIP_SNTP_UPDATE_DELAY=1800000
# Keep TLS buffers in Internal RAM. Dynamic buffers release that memory between
# requests, and the 2 KiB TX record is sufficient for bounded Xiaozhi
# Opus/control frames while I2S capture is active.
CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048
# Hardware AES allocates transient DMA descriptors for each TLS record. That
# collides with active I2S RX DMA on this target, so use the mbedTLS software
# AES implementation for the small, 16 kHz Opus WebSocket records instead.
# CONFIG_MBEDTLS_HARDWARE_AES is not set
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y
CONFIG_XIAOZHI_SYNC_SYSTEM_TIME_FROM_SERVER=n
CONFIG_XIAOZHI_AUDIO_TASK_ALLOC_STATIC=y
# Phase 13 production development must not auto-run the Phase-12 validation
# lifecycle from main.c. Dedicated Phase-12 HIL/test branches opt in explicitly.
CONFIG_XIAOZHI_FOUNDATION_VALIDATION_ENABLE=n
CONFIG_LV_USE_CUSTOM_MALLOC=y
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_SOURCE_HAN_SANS_SC_14_CJK=y
# app_main() owns the startup sequence and remains alive for deferred service
# activation. The ESP-IDF default 3584-byte stack overflowed on target.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_LV_USE_QRCODE=y
